---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctSettings.FlatOnBottom
source: html/6d4acd42-372e-9ed4-bad2-dc019b99239f.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSettings.FlatOnBottom Property

The abbreviation of the Flat On Bottom (FOB) string.

## Syntax (C#)
```csharp
public string FlatOnBottom { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null